In [1]:
import numpy as np
import pandas as pd

# Get the domain name and receipient name from email ID

In [50]:
s = 'prateek.rathore@gmail.com'

In [51]:
n = s.index('@')
print(n)

15

In [52]:
s[n+1:]

'g@mail.com'

In [53]:
s[:n]

'prateek.rathore'

In [253]:
#Multiple Indexing

Email_ID = 'prateek@rathore@gmail.com'
Match_Char = '@'
    
Pos_Match_Char = ([pos for pos, char in enumerate(Email_ID) if char == Match_Char])

print((Pos_Match_Char))

[7, 15]

# Words/Characters Count Problem

In [89]:
words = """the quick brown fox jumps over the lazy dog.
the cow jumps over the moon. 
the dog fox apple black brown.
"""

In [90]:
words_count = {}

In [91]:
words = words.replace("\n"," ")
words = words.replace("."," ")

In [92]:
print(words)

the quick brown fox jumps over the lazy dog  the cow jumps over the moon   the dog fox apple black brown

In [93]:
for word in words.split(" "):
    #words_count[word] = len(word)
    if len(word) > 0:
        if word == 'fox':
            words_count[word] = words_count.get(word,0)+1 #Python fetches key value if it exists then original value else 0
        #print(words_count.get(word,0)+1)

In [94]:
print(words_count)

{'fox': 2}

In [88]:
s='abbcccdddddeeeee'
from collections import Counter
x = Counter(s)
print(x)

Counter({'d': 5, 'e': 5, 'c': 3, 'b': 2, 'a': 1})

{'the': 5, 'quick': 1, 'brown': 2, 'fox': 2, 'jumps': 2, 'over': 2, 'lazy': 1, 'dog': 2, 'cow': 1, 'moon': 1, 'apple': 1, 'black': 1}

# Tuples are immutables ?

In [98]:
a = (1,2,[4,5,6],7)
print(type(a))

<class 'tuple'>

In [96]:
b = [1,2,3,4]
b[1]=100
b

[1, 100, 3, 4]

In [104]:
a[2][1] = 100

In [105]:
print(a)

(1, 2, [4, 100, 6], 7)

# Map, Filter and Reduce

In [42]:
#Map
num = ['3','4','5']

new_num = list(map(int,num))
print(f'{num} list string values changes to number {new_num}')

['3', '4', '5'] list string values changes to number [3, 4, 5]

In [ ]:
# Filter
mylist = [1,5,4,6,8,11,3,12]
xl = list(filter(lambda x: (x%2 == 0), mylist))
print(list(filter(lambda x: (x%2 == 0), mylist)))
print(xl)

In [45]:
#Reduce
from functools import reduce
num1 = [1,2,3,4,5]

new_num = reduce(lambda x,y:x+y, num1)
new_num

15

# Dataframe Rank

In [106]:
df1 = pd.DataFrame(data={'Animal': ['cat', 'penguin', 'dog',
                                   'spider', 'snake'],
                        'Number_legs': [4, 2, 4, 8, np.nan]})
df1

    Animal  Number_legs
0      cat          4.0
1  penguin          2.0
2      dog          4.0
3   spider          8.0
4    snake          NaN

In [107]:
df1['Max_Rank'] = df1['Number_legs'].rank(method = 'max')
df1['Dense_Rank'] = df1['Number_legs'].rank(method = 'dense', ascending = False)
df1['Min_Rank'] = df1['Number_legs'].rank(method = 'min')
df1

    Animal  Number_legs  Max_Rank  Dense_Rank  Min_Rank
0      cat          4.0       3.0         2.0       2.0
1  penguin          2.0       1.0         3.0       1.0
2      dog          4.0       3.0         2.0       2.0
3   spider          8.0       4.0         1.0       4.0
4    snake          NaN       NaN         NaN       NaN

In [160]:
employee = pd.DataFrame(data={'Emp_Name': ['Farhan', 'Arti', 'Shrish',
                                   'Sreekar', 'Adil','Shruti'],
                        'Salary': [10000,20000,15000,23000,45000,30000],
                             'Dept':['IT','IT','IT','Sales','Sales','Sales']})
employee

  Emp_Name  Salary   Dept
0   Farhan   10000     IT
1     Arti   20000     IT
2   Shrish   15000     IT
3  Sreekar   23000  Sales
4     Adil   45000  Sales
5   Shruti   30000  Sales

In [161]:
employee.groupby('Dept').Salary.max()

Dept
IT       20000
Sales    45000
Name: Salary, dtype: int64

In [162]:
employee['rank'] = employee.groupby('Dept').Salary.rank(method = 'dense', ascending = False)
#employee
employee[(employee['rank']==3)]

  Emp_Name  Salary   Dept  rank
0   Farhan   10000     IT   3.0
3  Sreekar   23000  Sales   3.0

In [163]:
 employee.groupby('Dept').Salary.mean()

Dept
IT       15000.000000
Sales    32666.666667
Name: Salary, dtype: float64

In [165]:
# Filter dataframe rows on column values as list

emp_list = ['Farhan','Sreekar']
employee[employee['Emp_Name'].isin(emp_list)]

  Emp_Name  Salary   Dept  rank
0   Farhan   10000     IT   3.0
3  Sreekar   23000  Sales   3.0

# Decorators

In [131]:
def fun(func1):
    func1('Prateek')
func1 = print
fun(func1)

Prateek

In [142]:
def dec1(func1):
    def nowexec():
        print('Executing Now')
        func1()
        print('Executed')
    return(nowexec)

def who_is_harry():
    print("Harry is a good boy")
    
who_is_harry = dec1(who_is_harry)
who_is_harry()
print(who_is_harry)

Executing Now
Harry is a good boy
Executed
<function dec1.<locals>.nowexec at 0x000002216B9EE790>

# Try and Except

In [191]:
x = input('Enter value of x: ')
y = input('Enter value of y: ')
#print('sum is', int(x)+int(y))
try:
    print('sum is', int(x)+int(y))
except:
    print(f'{y} is not acceptable as integer')
    
print('The below code will continue to work')

Enter value of x: r
Enter value of y: 3
3 is not acceptable as integer
The below code will continue to work

In [193]:
x = input('Enter value of x: ')
y = input('Enter value of y: ')

try:
    print('sum is', int(x)+int(y))
except Exception as e:
    print(f'{e} is not acceptable as integer')
    
print('The below code will continue to work')

Enter value of x: 3
Enter value of y: 2w
invalid literal for int() with base 10: '2w' is not acceptable as integer
The below code will continue to work

# Modularization

In [210]:
a = input('Enter value of x: ')
b = input('Enter value of y: ')

def sum_cube(a,b):
    return(int(a)**3 + int(b)**3)

sum_cube = sum_cube(a,b)
print(sum_cube)

Enter value of x: 2
Enter value of y: 3
35

In [232]:
import prateek_func

In [233]:
cube_sum = prateek_func.cube_sum(int(a),int(b))
print(cube_sum)

ab_wholesqr = prateek_func.ab_wholesqr(int(a),int(b))
print(ab_wholesqr)

35
25

# File Handling

In [247]:
#Write dataframe to excel and csv
writer = pd.ExcelWriter('C:/Users/NAVNEET03/Edukeeda/emp_test_data.xlsx', engine='xlsxwriter')
new_employee.to_excel(writer, sheet_name='Main_Data')
employee.to_excel(writer, sheet_name='Org_Emp')
writer.save()


#csv
new_employee.to_csv('employee_data.csv')

In [248]:
writer.close()

# Group by Function

In [239]:
new_employee = pd.DataFrame(data={'Emp_Name': ['Farhan', 'Arti', 'Shrish',
                                   'Sreekar', 'Adil','Shruti'],
                        'Salary': [10000,20000,15000,23000,45000,30000],
                             'Dept':['IT','IT','IT','Sales','Sales','Sales'],
                                 'Age':['23','25','26','27','28','29']})
new_employee

  Emp_Name  Salary   Dept Age
0   Farhan   10000     IT  23
1     Arti   20000     IT  25
2   Shrish   15000     IT  26
3  Sreekar   23000  Sales  27
4     Adil   45000  Sales  28
5   Shruti   30000  Sales  29

In [235]:
new_employee.groupby('Dept').Salary.agg(['count','max','min'])

       count    max    min
Dept
IT         3  20000  10000
Sales      3  45000  23000

In [237]:
# Filter dataframe rows on column values as list

emp_list = ['Farhan','Sreekar','Adil']

#new_employee[(new_employee['Emp_Name'] == emp_list[0])|(new_employee['Emp_Name'] == emp_list[1])]

new_employee[new_employee['Emp_Name'].isin(emp_list)]

  Emp_Name  Salary   Dept Age
0   Farhan   10000     IT  23
3  Sreekar   23000  Sales  27
4     Adil   45000  Sales  28

# Apply Function

In [174]:
new_employee.Age.astype(int)

0    23
1    25
2    26
3    27
4    28
5    29
Name: Age, dtype: int32

In [213]:
def age_category(x):
    if int(x) < 25 :
        return ('Young')
    else:
        return('Adult')

In [240]:
new_employee['Age_Category'] = new_employee['Age'].apply(age_category)
new_employee

  Emp_Name  Salary   Dept Age Age_Category
0   Farhan   10000     IT  23        Young
1     Arti   20000     IT  25        Adult
2   Shrish   15000     IT  26        Adult
3  Sreekar   23000  Sales  27        Adult
4     Adil   45000  Sales  28        Adult
5   Shruti   30000  Sales  29        Adult

In [241]:
new_employee['Age_Mul'] = new_employee['Age'].apply(lambda x:int(x)*2)
new_employee

  Emp_Name  Salary   Dept Age Age_Category  Age_Mul
0   Farhan   10000     IT  23        Young       46
1     Arti   20000     IT  25        Adult       50
2   Shrish   15000     IT  26        Adult       52
3  Sreekar   23000  Sales  27        Adult       54
4     Adil   45000  Sales  28        Adult       56
5   Shruti   30000  Sales  29        Adult       58

In [249]:
x=[]
for i in range(0,5):
    a = input("Enter your name :")
    x.append(a)
print(x)

Enter your name :Prateek
Enter your name :Nishant
Enter your name :Ashu
Enter your name :Shruti
Enter your name :Swati
['Prateek', 'Nishant', 'Ashu', 'Shruti', 'Swati']

In [257]:
#a^3 + b^3 = c^3 + d^3
9**3 + 10**3 == 12**3 + 1**3
print(9**3 + 10**3)

1729